Revit 2027 API
FamilyLoadedIntoDocumentEventArgs Class
 The event arguments used by the FamilyLoadedInto event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.FamilyLoadedIntoDocumentEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyLoadedIntoDocumentEventArgs : RevitAPIPostDocEventArgs
Public Class FamilyLoadedIntoDocumentEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class FamilyLoadedIntoDocumentEventArgs : public RevitAPIPostDocEventArgs
type FamilyLoadedIntoDocumentEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The FamilyLoadedIntoDocumentEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Document |  The document associated with the event.
(Inherited from RevitAPIPostDocEventArgs)
FamilyName |  The file name of the family that is loaded into the document.
FamilyPath |  The file path of the family that is loaded into the document.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
NewFamilyId |  The newly loaded family id.
OriginalFamilyId |  The original family id that is overridden by the newly loaded family.
Status |  Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
(Inherited from RevitAPIPostEventArgs)
Top
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace